**EXPLORATORY DATA ANALYSIS (EDA)**

- we have 4 important packages or modules available
1. pandas
    - data operations
2. numpy
    - numerical operations
3. matplotlib
    - for plotting
4. seaborn
    - for plotting

In [ ]:
================================== EDA =====================================
1) pandas          : data frame operations
2) numpy           : math operations
3) matplotlib      : plotting or graphs
4) seaborn         : plotting or graphs
5) plotly          : plotting or graph
6) bokhe           : plotting or graph

================================ machine learning ============================
7) sickit-learn(sk-learn) : for all ml algorithms
8) stats                  : for statistical operations

================================= deep learning ================================   
9) tensor flow    : for deep learning models(google)
10) keras         : for deep learning models tensorflow as backend
11) pytorch       : for deep learning models(meta)
12) opencv        : for image and video operations
13) pillow        : for image operations

=================================== object detection models(transfer learning) ================================
14) mobilenet    : deeplearning packages
15) VGGnet       : deeplearning packages
16) resnet       : deeplearning packages
17) inceptionv3  : deeplearning packages
18) YOLO         : deeplearning packages

====================================== natural language process =========================
19) NLTK      : Natural Language Tool Kit
20) spcy      : alternative to nltk
21) wordcloud : used for text representation

====================================== NLP word embedding models ==============================
22) word2vec  : google
23) glove     : stanford
24) Fasttext  : meta(facebook)

====================================== ALLEN NLP(organization) =====================================
25) NLP applications : pyspark as backend

======================================== OPTICAL CHARACTER RECOGNIZATION (OCR) ====================================
extract the text from image
26) tesseract
27) easyocr

========================================= BERT =========================================
BERT : Bi directional Encoded Representation from Transformers
28) transformers  : Hugging face (google)

=========================================== webscrapping ====================================
29) SQLITE : connect the database using python
30) selenium
31) beautiful soup
32) Regex

================================================ Generative AI and LLM ====================================
33) langchain  : to connect all the llm models
34) GPT        : open AI
35) Gemini     : google
36) llama      : meta
37) Grok       : X AI
38) BedRock    : amazon
39) Claude AI  : Anthropic

============================================== AI agents ====================================
40) langraph
41) crewai
42) phidata
43) autogen

======================================== API creation ====================================
44) Flask
45) fastapi
46) Gradio
47) Django

========================================= web applications =====================================
48) streamlit

============================================= model deployment (MLops) ====================================
49) mlflow
50) kubeflow

============================================= cloud AI ===============================================
51) Azure cognitive services
52) Azure ML studio
53) GCP vertexAI
54) AWS sagemaker

=============================================== extra packages ==============================================
55) random
56) time
57) math
58) logging
59) warnings
60) date

**STEP-1: IMPORT PACKAGES**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**STEP-2: CREATE DATA FRAME USING LIST**

In [2]:
names=['ramesh','suresh','mahesh']
pd.DataFrame(names)

        0
0  ramesh
1  suresh
2  mahesh

In [3]:
names=['ramesh','suresh','mahesh']
age=[21,22,23]
pd.DataFrame(zip(names,age))

        0   1
0  ramesh  21
1  suresh  22
2  mahesh  23

In [4]:
names=['ramesh','suresh','mahesh']
age=[21,22,23]
city=['BLR','HYD','CHE']
pd.DataFrame(zip(names,age,city))

        0   1    2
0  ramesh  21  BLR
1  suresh  22  HYD
2  mahesh  23  CHE

**STEP-3: INSERT THE COLUMNS**
- column value expects an index or array

In [5]:
names=['ramesh','suresh','mahesh']
pd.DataFrame(names,columns=['NAMES'])

    NAMES
0  ramesh
1  suresh
2  mahesh

In [6]:
names=['ramesh','suresh','mahesh']
age=[21,22,23]
city=['BLR','HYD','CHE']
pd.DataFrame(zip(names,age,city),columns=['NAMES','AGE','CITY'])

    NAMES  AGE CITY
0  ramesh   21  BLR
1  suresh   22  HYD
2  mahesh   23  CHE

**STEP-4: MODIFY THE INDEX**

In [7]:
names=['Ramesh','Suresh','Mahesh']
age=[21,22,23]
city=['BLR','HYD','CHE']
inde=['A','B','C']
df1=pd.DataFrame(zip(names,age,city),index=inde,columns=['NAMES','AGE','CITY'])
df1

    NAMES  AGE CITY
A  Ramesh   21  BLR
B  Suresh   22  HYD
C  Mahesh   23  CHE

In [8]:
product=['kitkat','Gonemad','Fivestar']
cost=[20,10,15]
quant=[2,5,6]
indx=['A','B','C']
col=['PRODUCT','COST','QUANTITY']
df2=pd.DataFrame(zip(product,cost,quant),index=indx,columns=col)
df2

    PRODUCT  COST  QUANTITY
A    kitkat    20         2
B   Gonemad    10         5
C  Fivestar    15         6

In [9]:
type(df1)

pandas.core.frame.DataFrame

- 'INDEX' length should be matched with number of rows
- 'COLUMN' length should match with number of columns

**STEP-5: CREATE A DATA FRAME USING DICTIONARY**

In [10]:
names=['ramesh','suresh','mahesh']
age=[21,22,23]
city=['BLR','HYD','CHE']
d={'NAMES':['ramesh','suresh','mahesh'],
 'AGE':[21,22,23],
 'CITY':['BLR','HYD','CHE']}
pd.DataFrame(d)
# keys behave as columns
# column name is not required to be mentioned

    NAMES  AGE CITY
0  ramesh   21  BLR
1  suresh   22  HYD
2  mahesh   23  CHE

**STEP-6: CREATE A DATA FRAME USING SCALAR VALUES MEANS WITHOUT LIST**

In [11]:
d={'NAMES':'ramesh',
 'AGE':21,
 'CITY':'HYD'}
pd.DataFrame(d,index=[1])

    NAMES  AGE CITY
1  ramesh   21  HYD

**STEP-7: DATA QUICK CHEKS**

- shape

- size

- len

- columns

- dtypes

In [12]:
df1.shape

(3, 3)

In [13]:
df1.size

9

In [14]:
df1.columns

Index(['NAMES', 'AGE', 'CITY'], dtype='object')

In [15]:
df1.dtypes

NAMES    object
AGE       int64
CITY     object
dtype: object

In [16]:
len(df1)

3

In [17]:
import pandas as pd
bike={
  "brand": ["Ford"],
  "model": ["Mustang"],
  "year": [196]
    }
df=pd.DataFrame(bike,index=[1])
df

  brand    model  year
1  Ford  Mustang   196

**Step-8:Add data to empty DataFrame**

In [18]:
d1=pd.DataFrame()
d1['Name']=['Ramesh','Suresh','Satish']
d1['Age']=[20,21,22]
d1

     Name  Age
0  Ramesh   20
1  Suresh   21
2  Satish   22

**Step-9:Add data to already existing DataFrame**

- df1 already has a data with column Names,Age,City

- Now we want to create a new column with Marks

In [19]:
df1

    NAMES  AGE CITY
A  Ramesh   21  BLR
B  Suresh   22  HYD
C  Mahesh   23  CHE

In [20]:
df1['Marks']=[100,200,300]
df1

    NAMES  AGE CITY  Marks
A  Ramesh   21  BLR    100
B  Suresh   22  HYD    200
C  Mahesh   23  CHE    300

**Step-10:How to update column values**

- if you want to add the new column to empty DataFrame

- if you want to add the new column to already existed DataFrame

- if you want to modify the data of a specific column, the syntax is same

- df[colname]=[data]

In [21]:
df1['CITY']=['Hyderabad','Mumbai','Pune']
df1
df1['city']=['Hyderabad','Mumbai','Pune']
df1

    NAMES  AGE       CITY  Marks       city
A  Ramesh   21  Hyderabad    100  Hyderabad
B  Suresh   22     Mumbai    200     Mumbai
C  Mahesh   23       Pune    300       Pune

**Step-11:How to drop a specific column**

- by default axis=0 repesents index

- use inplace to make the changes permanently

In [22]:
df1.drop('city', axis=1, inplace=True)

In [23]:
df1

    NAMES  AGE       CITY  Marks
A  Ramesh   21  Hyderabad    100
B  Suresh   22     Mumbai    200
C  Mahesh   23       Pune    300

In [24]:
df1.drop(columns='AGE',inplace=True)
df1

    NAMES       CITY  Marks
A  Ramesh  Hyderabad    100
B  Suresh     Mumbai    200
C  Mahesh       Pune    300

In [25]:
df1['Names']=['Ramesh','Suresh','Mahesh']

In [26]:
df1.drop(columns='NAMES',inplace=True)

In [27]:
df1

        CITY  Marks   Names
A  Hyderabad    100  Ramesh
B     Mumbai    200  Suresh
C       Pune    300  Mahesh

In [28]:
df1['Age']=[20,21,22]

In [29]:
df1

        CITY  Marks   Names  Age
A  Hyderabad    100  Ramesh   20
B     Mumbai    200  Suresh   21
C       Pune    300  Mahesh   22

In [30]:
df1['City']=['Hyderabad','Mumbai','Pune']
df1.drop(columns='CITY',inplace=True)

In [31]:
df1

   Marks   Names  Age       City
A    100  Ramesh   20  Hyderabad
B    200  Suresh   21     Mumbai
C    300  Mahesh   22       Pune

In [32]:
df1.drop(columns='Marks',inplace=True)

In [33]:
df1['Marks']=[100,200,300]

In [34]:
df1

    Names  Age       City  Marks
A  Ramesh   20  Hyderabad    100
B  Suresh   21     Mumbai    200
C  Mahesh   22       Pune    300

In [35]:
df1

    Names  Age       City  Marks
A  Ramesh   20  Hyderabad    100
B  Suresh   21     Mumbai    200
C  Mahesh   22       Pune    300

**Step-12:Rename a column**

- create a dictinary, key as old name and value as new name

In [36]:
dict1={'Marks':'marks'}
df1.rename(dict1,axis=1)

    Names  Age       City  marks
A  Ramesh   20  Hyderabad    100
B  Suresh   21     Mumbai    200
C  Mahesh   22       Pune    300

In [37]:
dict1={'Marks':'marks'}
df1.rename(columns=dict1)

    Names  Age       City  marks
A  Ramesh   20  Hyderabad    100
B  Suresh   21     Mumbai    200
C  Mahesh   22       Pune    300

In [38]:
df1

    Names  Age       City  Marks
A  Ramesh   20  Hyderabad    100
B  Suresh   21     Mumbai    200
C  Mahesh   22       Pune    300

In [39]:
df1.columns=['names','age','city','marks']
df1

    names  age       city  marks
A  Ramesh   20  Hyderabad    100
B  Suresh   21     Mumbai    200
C  Mahesh   22       Pune    300

**Step-13:Add a new row**

In [40]:
df1.loc['D']=['Rajath','21','Hyderbad','400']

In [41]:
df1

    names age       city marks
A  Ramesh  20  Hyderabad   100
B  Suresh  21     Mumbai   200
C  Mahesh  22       Pune   300
D  Rajath  21   Hyderbad   400

In [42]:
df1.drop(labels='D')

    names age       city marks
A  Ramesh  20  Hyderabad   100
B  Suresh  21     Mumbai   200
C  Mahesh  22       Pune   300

**Step-14:Save the DataFrame**

In [43]:
df1.to_csv('data.csv')

In [44]:
pd.read_csv('data.csv')

  Unnamed: 0   names  age       city  marks
0          A  Ramesh   20  Hyderabad    100
1          B  Suresh   21     Mumbai    200
2          C  Mahesh   22       Pune    300
3          D  Rajath   21   Hyderbad    400

In [45]:
df1.to_csv('data.csv',index=False)

In [46]:
pd.read_csv('data.csv')

    names  age       city  marks
0  Ramesh   20  Hyderabad    100
1  Suresh   21     Mumbai    200
2  Mahesh   22       Pune    300
3  Rajath   21   Hyderbad    400

In [51]:
a=10
b=20
c=a+b
print(c)

30